backend/api/Anexo 2 - Request SOAP - WSBuscarPaciente.xml

<x:Envelope
    xmlns:x="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:uni="Univer360_Produccion">
    <x:Header/>
    <x:Body>
        <uni:WSBuscarPaciente.Execute>
            <uni:Homsedciucli>1</uni:Homsedciucli>
            <uni:Pactipidecod>CC</uni:Pactipidecod>
            <uni:Pacnumide>1112769409</uni:Pacnumide>
            <uni:Usulog>CITAWEB</uni:Usulog>
            <uni:Usupas>Abc123*</uni:Usupas>
        </uni:WSBuscarPaciente.Execute>
    </x:Body>
</x:Envelope>